# Core helpers (must load early)
mattmc3/zfunctions
romkatv/zsh-defer
romkatv/powerlevel10k
# Completions
zsh-users/zsh-completions kind:fpath path:src
belak/zsh-utils path:completion

# Lightweight utilities (faster than OMZ equivalents)
belak/zsh-utils path:editor
belak/zsh-utils path:history
belak/zsh-utils path:prompt
belak/zsh-utils path:utility

# Essential OMZ (minimal)
getantidote/use-omz
ohmyzsh/ohmyzsh path:lib/git.zsh
ohmyzsh/ohmyzsh path:lib/key-bindings.zsh
ohmyzsh/ohmyzsh path:lib/termsupport.zsh

# Plugins
MichaelAquilina/zsh-you-should-use
rupa/z

# OMZ Plugins
ohmyzsh/ohmyzsh path:plugins/dirhistory
ohmyzsh/ohmyzsh path:plugins/git
jeffreytse/zsh-vi-mode

# Syntax and suggestions (deferred)
zsh-users/zsh-syntax-highlighting kind:defer
zsh-users/zsh-autosuggestions kind:defer
zsh-users/zsh-history-substring-search kind:defer
